import React from 'react';
import '../../index.css';
import Carousel, { CarouselItem } from '../Carousel/Carousel';

function App() {
  return (
    <section className="slider">
      <Carousel>
        <CarouselItem
          date="25.07.2022 г."
          title="Мост Золотые ворота"
          text="Знаменитый подвесной мост в Сан-Франциско на самом деле не из золота, и даже, не золотого цвета."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd1.jpg"
        />
        <CarouselItem
          date="25.07.2022 г."
          title="Гонконг"
          text="Гонконг — тихоокеанский рубеж западной цивилизации на Азиатском континенте. В Гонконге находится больше небоскрёбов, чем в Нью-Йорке."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd2.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Австралия"
          text="Страна может похвастаться самым большим количеством пляжей — более 10 тысяч, больше, чем в любой другой стране."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd4.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Биг-Бен"
          text="Если вы думаете, что это башня Вестминстерского дворца, то вы ошибаетесь. Башня носит официальное название «Башня Елизаветы»."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd3.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Статуя свободы"
          text="Построенная французским скульптором Фредериком Огюстом Бартольди, статуя была перевезена в Америку из Европы,
          будучи разобранной на 350 отдельных частей."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd5.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Эйфелева башня"
          text="Для более шести сотен парижан Эйфелева башня является местом постоянной работы."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd6.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Гранд Каньон"
          text="Гранд Каньон в Аризоне, конечно большой, но не самый протяженный в мире. Тибетский каньон Ярлунг Цангпо
          несколько длинней 504,6 километра, а Гранд Каньон имеет длину 446 километров."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd7.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Ниагарский водопад"
          text="Ниагарский водопад пропускает ежеминутно до 6 миллионов кубических метров воды. Этого достаточно,
          чтобы заполнить доверху миллион ванн за 60 секунд."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd8.jpg"
        />
        <CarouselItem
          date="25.07.2022 г."
          title="Ватикан"
          text="В Ватикане находится самый большой в мире музейный комплекс, с множеством ценностей, сокровищ и различных предметов культуры,
          собранных папами на протяжении многих веков."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd10.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Великая Китайская стена"
          text="Несмотря на то, что многие источники уверяют, что Великую Китайскую Стену видно с Луны, НАСА опровергает эту информацию."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd9.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Надпись Голливуд"
          text="Надпись Голливуд, что в Лос-Анджелесе, изначально строилась, как рекламный щит, и предполагалось, что она простоит всего один год."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd11.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Саграда Фамилия"
          text="Самой популярной достопримечательностью Барселоны является Базилика Святого Семейства или Саграда Фамилия."
          image="https://wayempire.com/wp-content/uploads/2014/11/ifd12.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Мустанги Лас-Колинаса, Техас"
          text="Скульптурное произведение в городе Ирвинг, состоящая из девяти лошадей-мустангов, некогда водившихся в большом количестве в этих краях."
          image="https://wayempire.com/wp-content/uploads/2015/02/wmcs1.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Завязанный пистолет, Нью-Йорк"
          text="Памятник посвящен Джону Леннону, которого застрелил сумасшедший фанат. Интересно, что такой памятник есть не только в Нью-Йорке,
          а всего их насчитывается 16 штук. "
          image="https://wayempire.com/wp-content/uploads/2015/02/wmcs7.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Путешественник, Марсель, Франция"
          text="На самом деле памятник не одинок, а их целая серия, и у каждого из них отсутствует значительная часть тела."
          image="https://wayempire.com/wp-content/uploads/2015/02/wmcs10.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Нельсон Мандела, ЮАР"
          text="Нельсон Мандела — один из самых знаменитых политиков мира и борец за права чернокожих в Южно-Африканской Республике."
          image="https://wayempire.com/wp-content/uploads/2015/02/wmcs11.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Тонущее здание, Мельбурн, Австралия"
          text="На тонущем здании остались пять литер «LIBRA..» а с другой две «RY», достроив слово до конца, можно получить слово LIBRARY,
          что в переводе «библиотека»."
          image="https://wayempire.com/wp-content/uploads/2015/02/wmcs15.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Каньон Антилопы"
          text="Каньон Антилопы — одно из самых посещаемых мест в США. Находится он на земле индейцев Навахо в штате Аризона и
          для посещений был открыт всего лишь в 1997 году с их согласия. "
          image="https://wayempire.com/wp-content/uploads/2014/10/1.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Бамбуковый лес в Японии"
          text="Бамбуковый лес находится к северо-западу от Киото и занимает площадь 16 квадратных километров."
          image="https://wayempire.com/wp-content/uploads/2014/10/2.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Черный лес в Германии"
          text="Шварцвальд, как его называют в Германии, имеет размеры 200 на 60 километров. Плотный рост хвойных и
          буковых деревьев мешают солнечному свету проникать в гущу леса."
          image="https://wayempire.com/wp-content/uploads/2014/10/3.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Рапсовые поля в Китае"
          text="Рапсовые поля создают одни из самых красивых пейзажев мира. Обширные сельскохозяйственные поля
          покрываются цветами желтого рапса (рапсовое масло) вплоть до горизонта."
          image="https://wayempire.com/wp-content/uploads/2014/10/4.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Гора Рорайма"
          text="Гора Рорайма находится на границе сразу трёх стран Южной Америки — Венесуэлы, Бразилии и Гайаны,
          а пик является точкой соприкосновения этих трёх границ."
          image="https://wayempire.com/wp-content/uploads/2014/10/5.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Хитачи Сисайд Парк в Японии"
          text="Хитачи Сисайд Парк — общественный парк, где круглый год проходят выставки цветов. Парк известен своими
          сезонными выставками: нарциссов и тюльпанов весной, роз в начале лета и бассии осенью."
          image="https://wayempire.com/wp-content/uploads/2014/10/7.jpg"
        />
        <CarouselItem
          date="31.07.2022 г."
          title="Лавандовые поля в Провансе, Франция"
          text="Лавандовые поля в Провансе можно наблюдать в конце июня-июле — это лучшее время для этого."
          image="https://wayempire.com/wp-content/uploads/2014/10/8.jpg"
        />
      </Carousel>
    </section>
  );
}

export default App;
