import React from 'react';
import '../../index.css';
import Carousel, { CarouselItem } from '../Carousel/Carousel';

function App() {
  return (
    <section className="slider">
      <Carousel>
        <CarouselItem
          date="10.11.2022 г."
          title="Ким и Валерия Брейтбурги написали книгу про искусство"
          text="Работа над книгой велась более пяти лет, и действенные методики, описанные в ней, созданные в результате анализа и синтеза идей…"
        />
        <CarouselItem
          date="9.11.2022 г."
          title="Юрий Колокольников пытается спасти Землю в клипе «Космические силы»"
          text="Премьера клипа «Космические силы» группы «Мумий Тролль» состоялась 6 ноября 2020 года."
        />
        <CarouselItem
          date="11.11.2022 г."
          title="BTS получили четыре награды MTV EMA"
          text="BTS получили четыре награды MTV EMA 27-я ежегодная церемония награждения MTV Europe Music Awards состоялась 8 ноября 2020 г."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
        <CarouselItem
          date="12.11.2022 г."
          title="Открытие сезона «Ла Скала» отменено"
          text="Миланский театр La Scala отменил открытие сезона. Первый спектакль был назначен на 7 декабря — «Лючия ди Ламмермур»."
        />
      </Carousel>
    </section>
  );
}

export default App;
